Autodesk.Revit.DB.ModelPath.GetModelGUID
A GUID identifying the A360 model.
Since:
2012

Autodesk.Revit.DB.ModelPath.GetProjectGUID
A GUID identifying the A360 project to which the model is associated.
Since:
2012

Autodesk.Revit.DB.ModelPath.CloudPath
Whether this path is a cloud path
Since:
2012

Autodesk.Revit.DB.ModelPath
A path to a file stored on a disk or on a server.
Remarks:
ModelPaths are paths to another file. They can
refer to Revit models, or to any of Revit's external
file references (DWG links, for example.)
Paths can be relative or absolute, but they must
include an extension indicating what kind of file it is.
Relative paths are generally relative to the currently
opened document. If the current document is workshared,
paths will be treated as relative to the central model.
To create a ModelPath, use the derived classes FilePath
and ServerPath.
The class ModelPathUtils contains utility functions for
converting ModelPaths to and from strings.
Since:
2012